unitTests/pybind11/pimpleFOAM_pybind/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

backgroundMesh
{
    xMin     0;
    xMax     0.9;
    yMin     0;
    yMax     0.9;
    zMin     0;
    zMax     0.1;
    xCells1  5;
    yCells   5;
    zCells   1;
}

convertToMeters 1;

vertices        
(
    ($:backgroundMesh.xMin $:backgroundMesh.yMin $:backgroundMesh.zMin)
    ($:backgroundMesh.xMax $:backgroundMesh.yMin $:backgroundMesh.zMin)
    ($:backgroundMesh.xMax $:backgroundMesh.yMax $:backgroundMesh.zMin)
    ($:backgroundMesh.xMin $:backgroundMesh.yMax $:backgroundMesh.zMin)
    ($:backgroundMesh.xMin $:backgroundMesh.yMin $:backgroundMesh.zMax)
    ($:backgroundMesh.xMax $:backgroundMesh.yMin $:backgroundMesh.zMax)
    ($:backgroundMesh.xMax $:backgroundMesh.yMax $:backgroundMesh.zMax)
    ($:backgroundMesh.xMin $:backgroundMesh.yMax $:backgroundMesh.zMax)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) ($:backgroundMesh.xCells1 $:backgroundMesh.yCells 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch left 
    (
        (0 4 7 3)
    )
    patch bottom 
    (
        (0 1 5 4)
    )
    patch right 
    (
        (1 2 6 5)
    )
    patch top 
    (
        (3 2 6 7)
    )
    empty frontAndBack 
    (
        (0 1 2 3)
        (4 5 6 7)
    )
);

mergePatchPairs 
(
);

// ************************************************************************* //
