unitTests/pybind11/pimpleFOAM_pybind/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;

// Number of modes to output and to use for projection
NmodesUout 15;
NmodesUproj 10;
NmodesPout 15;
NmodesPproj 10;
NmodesSUPout 15;
NmodesSUPproj 12;

// Output format to save market vectors.
OutPrecision 20;
OutType fixed;

// Specific problem of a stationary case
tolerance 1e-5;

// Export Reduced Matrices
exportPython 1;
exportMatlab 1;
exportTxt 1;

bcMethod lift;

POD_U L2;
POD_p L2;
POD_Usup L2;

normalizationNorm L2;
